codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe064.h
#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_I2C5MIS_POSITION                  0x00000000
#define _IPC46_I2C5MIS_MASK                      0x00000003
#define _IPC46_I2C5MIS_LENGTH                    0x00000002

#define _IPC46_I2C5MIP_POSITION                  0x00000002
#define _IPC46_I2C5MIP_MASK                      0x0000001C
#define _IPC46_I2C5MIP_LENGTH                    0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_U6EIS_POSITION                    0x00000000
#define _IPC47_U6EIS_MASK                        0x00000003
#define _IPC47_U6EIS_LENGTH                      0x00000002

#define _IPC47_U6EIP_POSITION                    0x00000002
#define _IPC47_U6EIP_MASK                        0x0000001C
#define _IPC47_U6EIP_LENGTH                      0x00000003

#define _IPC47_U6RXIS_POSITION                   0x00000008
#define _IPC47_U6RXIS_MASK                       0x00000300
#define _IPC47_U6RXIS_LENGTH                     0x00000002

#define _IPC47_U6RXIP_POSITION                   0x0000000A
#define _IPC47_U6RXIP_MASK                       0x00001C00
#define _IPC47_U6RXIP_LENGTH                     0x00000003

#define _IPC47_U6TXIS_POSITION                   0x00000010
#define _IPC47_U6TXIS_MASK                       0x00030000
#define _IPC47_U6TXIS_LENGTH                     0x00000002

#define _IPC47_U6TXIP_POSITION                   0x00000012
#define _IPC47_U6TXIP_MASK                       0x001C0000
#define _IPC47_U6TXIP_LENGTH                     0x00000003

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _IPC48_ADCEOSIS_POSITION                 0x00000000
#define _IPC48_ADCEOSIS_MASK                     0x00000003
#define _IPC48_ADCEOSIS_LENGTH                   0x00000002

#define _IPC48_ADCEOSIP_POSITION                 0x00000002
#define _IPC48_ADCEOSIP_MASK                     0x0000001C
#define _IPC48_ADCEOSIP_LENGTH                   0x00000003

#define _IPC48_ADCARDYIS_POSITION                0x00000008
#define _IPC48_ADCARDYIS_MASK                    0x00000300
#define _IPC48_ADCARDYIS_LENGTH                  0x00000002

#define _IPC48_ADCARDYIP_POSITION                0x0000000A
#define _IPC48_ADCARDYIP_MASK                    0x00001C00
#define _IPC48_ADCARDYIP_LENGTH                  0x00000003

#define _IPC48_ADCURDYIS_POSITION                0x00000010
#define _IPC48_ADCURDYIS_MASK                    0x00030000
#define _IPC48_ADCURDYIS_LENGTH                  0x00000002

#define _IPC48_ADCURDYIP_POSITION                0x00000012
#define _IPC48_ADCURDYIP_MASK                    0x001C0000
#define _IPC48_ADCURDYIP_LENGTH                  0x00000003

#define _IPC48_w_POSITION                        0x00000000
#define _IPC48_w_MASK                            0xFFFFFFFF
#define _IPC48_w_LENGTH                          0x00000020

#define _IPC49_ADCGRPIS_POSITION                 0x00000000
#define _IPC49_ADCGRPIS_MASK                     0x00000003
#define _IPC49_ADCGRPIS_LENGTH                   0x00000002

#define _IPC49_ADCGRPIP_POSITION                 0x00000002
#define _IPC49_ADCGRPIP_MASK                     0x0000001C
#define _IPC49_ADCGRPIP_LENGTH                   0x00000003

#define _IPC49_ADC0EIS_POSITION                  0x00000010
#define _IPC49_ADC0EIS_MASK                      0x00030000
#define _IPC49_ADC0EIS_LENGTH                    0x00000002

#define _IPC49_ADC0EIP_POSITION                  0x00000012
#define _IPC49_ADC0EIP_MASK                      0x001C0000
#define _IPC49_ADC0EIP_LENGTH                    0x00000003

#define _IPC49_ADC1EIS_POSITION                  0x00000018
#define _IPC49_ADC1EIS_MASK                      0x03000000
#define _IPC49_ADC1EIS_LENGTH                    0x00000002

#define _IPC49_ADC1EIP_POSITION                  0x0000001A
#define _IPC49_ADC1EIP_MASK                      0x1C000000
#define _IPC49_ADC1EIP_LENGTH                    0x00000003

#define _IPC49_w_POSITION                        0x00000000
#define _IPC49_w_MASK                            0xFFFFFFFF
#define _IPC49_w_LENGTH                          0x00000020

#define _IPC50_ADC2EIS_POSITION                  0x00000000
#define _IPC50_ADC2EIS_MASK                      0x00000003
#define _IPC50_ADC2EIS_LENGTH                    0x00000002

#define _IPC50_ADC2EIP_POSITION                  0x00000002
#define _IPC50_ADC2EIP_MASK                      0x0000001C
#define _IPC50_ADC2EIP_LENGTH                    0x00000003

#define _IPC50_ADC3EIS_POSITION                  0x00000008
#define _IPC50_ADC3EIS_MASK                      0x00000300
#define _IPC50_ADC3EIS_LENGTH                    0x00000002

#define _IPC50_ADC3EIP_POSITION                  0x0000000A
#define _IPC50_ADC3EIP_MASK                      0x00001C00
#define _IPC50_ADC3EIP_LENGTH                    0x00000003

#define _IPC50_ADC4EIS_POSITION                  0x00000010
#define _IPC50_ADC4EIS_MASK                      0x00030000
#define _IPC50_ADC4EIS_LENGTH                    0x00000002

#define _IPC50_ADC4EIP_POSITION                  0x00000012
#define _IPC50_ADC4EIP_MASK                      0x001C0000
#define _IPC50_ADC4EIP_LENGTH                    0x00000003

#define _IPC50_w_POSITION                        0x00000000
#define _IPC50_w_MASK                            0xFFFFFFFF
#define _IPC50_w_LENGTH                          0x00000020

#define _IPC51_ADC7EIS_POSITION                  0x00000008
#define _IPC51_ADC7EIS_MASK                      0x00000300
#define _IPC51_ADC7EIS_LENGTH                    0x00000002

#define _IPC51_ADC7EIP_POSITION                  0x0000000A
#define _IPC51_ADC7EIP_MASK                      0x00001C00
#define _IPC51_ADC7EIP_LENGTH                    0x00000003

#define _IPC51_ADC0WIS_POSITION                  0x00000010
#define _IPC51_ADC0WIS_MASK                      0x00030000
#define _IPC51_ADC0WIS_LENGTH                    0x00000002

#define _IPC51_ADC0WIP_POSITION                  0x00000012
#define _IPC51_ADC0WIP_MASK                      0x001C0000
#define _IPC51_ADC0WIP_LENGTH                    0x00000003

#define _IPC51_ADC1WIS_POSITION                  0x00000018
#define _IPC51_ADC1WIS_MASK                      0x03000000
#define _IPC51_ADC1WIS_LENGTH                    0x00000002

#define _IPC51_ADC1WIP_POSITION                  0x0000001A
#define _IPC51_ADC1WIP_MASK                      0x1C000000
#define _IPC51_ADC1WIP_LENGTH                    0x00000003

